In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NaN

### serise

In [2]:
se1=pd.Series([4,NaN,8,NaN,5])
print(se1)
se1.dropna()

0    4.0
1    NaN
2    8.0
3    NaN
4    5.0
dtype: float64

0    4.0
2    8.0
4    5.0
dtype: float64

In [3]:
se1[se1.notnull()]

0    4.0
2    8.0
4    5.0
dtype: float64

### dataframe

In [4]:
df1=pd.DataFrame([[1,2,3],[NaN,NaN,2],[NaN,NaN,NaN],[8,8,NaN]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

In [5]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [6]:
# 滤除全为NaN的行
df1.dropna(how = "all")

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
3  8.0  8.0  NaN

In [7]:
# 传入axis=1滤除列

df1[3]=NaN
df1

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  NaN  NaN  2.0 NaN
2  NaN  NaN  NaN NaN
3  8.0  8.0  NaN NaN

In [8]:
df1.dropna(axis=1,how="all")

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

In [9]:
# 传入thresh=n 保留至少有n个非NaN数据的行
df1.dropna(thresh=1)

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  NaN  NaN  2.0 NaN
3  8.0  8.0  NaN NaN

In [10]:
df1.dropna(thresh=3)

     0    1    2   3
0  1.0  2.0  3.0 NaN